import time 
print("Ти пішов в Крейзі Ленд")
time.sleep(1.5)
print("1.Ти можеш піти на батут")
time.sleep(1.5)
print("2.Ти можеш в лабіринт")

choice = int(input("куди ти підеш? 1 або 2 "))
time.sleep(1.5)
if choice == 1:
    print("Ти ідеш на батут")
    print("Тебе наругалu бо Ти зробив сальто")
    
    ruganina = input("якщо ти ведеш так то ти скажеш не твоє діло якщо ні тоти скажеш вибачте, я більше не буду Введи так або ні")

    if ruganina == "так":
        print("ти скажеш не твоє діло")
    elif ruganina == "ні":
        print("ти скажеш вибачте, я більше не буду")
    else:
        print("не то вибрав")
  
elif choice == 2:
    print("ти ідеш в лабіринт")
    print("ти заблукав, ти будеш звати на допомогу?(так\ні)")
     
    help = input("Введи так або ні")

    if help == "так":
        print("ти звеш на допомогу")
    elif help == "ні":
        print("ти не звеш на допомогу")
    else:
        print("не то вибрав")
print("ти вийшов зз крейзі ленду")
print("ти ідеш далі")
print("ти бачиш бомжа з пістолетом")
time.sleep(2.0)
print("бомж з пістолетом погрожує сметю або ти підеш з ним в підворітюю")
print("ти підеш за ним? (так\ні)")

vyl = input("ведии так або ні")

if vyl == "так":
    print("ти пішов за ним в підворітнню")
    print("він тебе прижав до стіни та пробував вбити")
    time.sleep(1.5)
    print("та ти дуже прудконогий ти побіг на головну вулицю")
elif vyl  == "ні" :
    print("ти почав відходити а потім  побігг")
print("ти пішов додому")
print("вдома ти смачно поїв та пішов спати")
print("1 день закінчився")
print("солодких снів")
time.sleep(5.5)
#2фаза
print("доброго ранку козаче")
print("тобі в голову стрельнула ідея піти в мобільні групи Украіни")
print("ти пішов до воєнкомату та став ппошником")
print("тобі попалась тяжка нічка бо зараз мосована атака по Дніпру")

shaxed_hunter = input("летять 25 шахедів ти будеш їх збивати? (так\ні)")

if shaxed_hunter == "так" :
    print("ти почав стріляти ту-ту-ту")
    print("ти збив 20 шахедів 5 збили інші хлопці")
elif shaxed_hunter =="ні":
    print("тебе наругали та звільнили")
    print("ти ідеш засмученний додоуму та плачеш ")
    print("ти прийшов додому та мама попросила тебе покрасити стіну")

stina = input("тебе мама попросила пофарбувати стіну ти будеш - ти допоможеш(так\ні)")

if stina == "так":
    print("ти допоміг матусі пофарбівати стіну")
elif stina == "ні":
    print("ти вибачився та пішов в свою кімнату")
print("ти прийшов в свою кімнату ти хочеш шось поробити (1,2,3)")

play = int(input("веди 1 , 2 , 3"))

if play == 1:
    print("ти будеш сидіти та втикати в ігри")
elif play == 2:
    print("ти будеш писати на компуктере писати код")
elif play == 3:
    print("ти сядеш читати книги")
print("ти позаймався чимось цікавим а поті знов пішов на вулицю")
print("на вулиці ти побачив своїх друзів")
print("серед них були твоя дівчина Анна, Миша,Ваня і Антон")
print("вони запропонували пограти в футбол 2х2 та Анна суддя")
print("Антон сказав щоб ти став на ворота ти будеш іти на ворота?(так\ні)")

vorota = input("веди так або ні")

if vorota == "так":
    print("ти підеш спокійно на ворота")
elif vorota == "ні":
    print("ти будеш сперечатися але потім підеш")
print("ти пограв та переміг")
print("потім ти пішов в магазин та купив продукти")
time.sleep(1.5)
print("ти купив кетчуп сметану та пельмені")
print("ти на вибір можеш обрати щось собі(1,2)")

magaz = int(input("обери число"))

if magaz == "1":
    print("ти взяв чипси")
elif magaz == "2":
    print("ти взяв яблуко та банан")
print("ти оплатив 150 гривень")
print("ти прийшов додому та ліг подивитися телевізор")
print("потім 2 день нашої історії кнчаєтся")
print("солодких снівввв!")
time.sleep(5.5)
print("доброго тебе покликала твоя Анна на побачення ти будеш іти (так\ні)")

pobachenna = str(input("так або ні"))

if pobachenna == "так":
    print("ти ідеш на побачення в кофе ")
    print("ти не пішов снідати")
elif pobachenna == "ні":
    print("ти не пішов та посварився з Анною")
    print("ти пішов снідати")
print("ти потім пішов в кімнату і вирішив подивитися графіки відключення ПРАТ ПЕЕМ ЦЕК")
print("він побачив що в нього зараз вимкнуть світло та пішов до діда казати щоб заводив генерато")
time.sleep(1.5)
print("ти вийшов на вулицю й почав гуляти")
print("ти побачив знов друзів та вони тебе попросили купити морозива купиш?(так\ні)")
 
morozyvka = input("ти підеш в магазин")

if morozyvka == "так":
    print("ти молодець ти пішов та купив морозиво для всіх")
    time.sleep(9.6)
    print("ти прийшов до друзів та всіх пригостив")
elif morozyvka == "ні":
    print("фу едино личник ")
print("потім ти пішов на заннятя по іт в WORLDIT")
print("НИКОЛАЙ відгриз тобі ноогууууууу!")
time.sleep(10)
print("повірив?")
time. sleep(2)
print("ха-ха-ха я пошуткував тебе Діана заставила відтискася 50раз")
print("ну як гра?(5 зірок\ 4 зірки \ 3 зірки\ 2  зірки \ 1 зірка\ 0 зірок)")
    
gra = int(input("веди 0 .1 , 2 , 3, 4,5,"))

if gra == "0":
    print("фу більше не приходь")
elif gra == "1":
    print("блин могло бить и лучче уходи") 
elif gra == "2":
    print("маловато будет ") 
elif gra == "3":
    print("ну уже лучше") 
elif gra == "4":
    print("лучше чем нечего")
elif gra == "5":
    print("красава")  